
package com.mzx.wechat.controller.constant;

/**
 * request中method的枚举常量
 *
 * @program XHotel
 * @description

 */

public enum RequestMethod {

    /**
     * 显示主页
     */
    INDEX_VIEW,

    /**
     * 无效请求
     */

    INVALID_REQUEST,
    /*
     **************************************************************
     *               用户功能模块
     **************************************************************
     */
    /**
     * 执行登陆方法
     */
    LOGIN_DO,
    /**
     * 执行注册方法
     */
    REGISTER_DO,
    /**
     * 执行退出登陆方法
     */
    LOGOUT_DO,
    /**
     * 更新密码
     */
    UPDATEPASSWORD_DO,

    /*
     **************************************************************
     *               聊天功能模块
     **************************************************************
     */
    /**
     * 加入聊天
     */
    JOIN_DO,
    /**
     * 退出聊天
     */
    QUIT_DO,
    /**
     * 查找群成员
     *
     */
    MEMBER_DO,



    /*
     **************************************************************
     *               好友功能模块
     **************************************************************
     */

    /*
     **************************************************************
     *               聊天记录功能模块
     **************************************************************
     */
    /**
     * 获取未读消息
     */
    UNREAD_DO,
    /**
     * 将消息设置为已读
     */
    READ_DO,
    /**
     * 删除一个聊天中所有聊天记录
     */
    CLEAR_DO,
    /**
     * 导出聊天记录
     */
    EXPORT_DO,
    /**
     * 移除群成员
     */
    REMOVE_DO,



    /*
     **************************************************************
     *               通用操作方法
     **************************************************************
     */
    /**
     * 上传
     */
    UPLOADPHOTO_DO,
    /**
     * 上传文件
     */
    UPLOADFILE_DO,
    /**
     * 更新聊天背景
     */
    BACKGROUND_DO,
    /**
     * 添加
     */
    ADD_DO,
    /**
     * 删除
     */
    DELETE_DO,
    /**
     * 更新
     */
    UPDATE_DO,
    /**
     * 查找一个对象
     */
    GET_DO,
    /**
     * 查找对象集合
     *
     */
    LIST_DO;

    @Override
    public String toString() {
        return super.toString().toLowerCase().replaceAll("_", ".");
    }


}

